Revit 2026 API

# ScheduleDefinitionRemoveSortGroupField Method

---

Removes a sorting/grouping field.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveSortGroupField(
	int index
)
```
```vb
Public Sub RemoveSortGroupField (
	index As Integer
)
```
```cpp
public:
void RemoveSortGroupField(
	int index
)
```
```fsharp
member RemoveSortGroupField :
        index : int -> unit
```

#### Parameters

index Int32
     The index of the sorting/grouping field to remove.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | index is not a valid sorting/grouping field index. |

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace